mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2d5xg/common/s6e2d5xg.h
typedef struct stc_canfd_txbar_field
{
        __IO  uint32_t  AR0                      :1;
        __IO  uint32_t  AR1                      :1;
        __IO  uint32_t  AR2                      :1;
        __IO  uint32_t  AR3                      :1;
        __IO  uint32_t  AR4                      :1;
        __IO  uint32_t  AR5                      :1;
        __IO  uint32_t  AR6                      :1;
        __IO  uint32_t  AR7                      :1;
        __IO  uint32_t  AR8                      :1;
        __IO  uint32_t  AR9                      :1;
        __IO  uint32_t  AR10                     :1;
        __IO  uint32_t  AR11                     :1;
        __IO  uint32_t  AR12                     :1;
        __IO  uint32_t  AR13                     :1;
        __IO  uint32_t  AR14                     :1;
        __IO  uint32_t  AR15                     :1;
        __IO  uint32_t  AR16                     :1;
        __IO  uint32_t  AR17                     :1;
        __IO  uint32_t  AR18                     :1;
        __IO  uint32_t  AR19                     :1;
        __IO  uint32_t  AR20                     :1;
        __IO  uint32_t  AR21                     :1;
        __IO  uint32_t  AR22                     :1;
        __IO  uint32_t  AR23                     :1;
        __IO  uint32_t  AR24                     :1;
        __IO  uint32_t  AR25                     :1;
        __IO  uint32_t  AR26                     :1;
        __IO  uint32_t  AR27                     :1;
        __IO  uint32_t  AR28                     :1;
        __IO  uint32_t  AR29                     :1;
        __IO  uint32_t  AR30                     :1;
        __IO  uint32_t  AR31                     :1;
} stc_canfd_txbar_field_t;

typedef struct stc_canfd_txbcr_field
{
        __IO  uint32_t  CR0                      :1;
        __IO  uint32_t  CR1                      :1;
        __IO  uint32_t  CR2                      :1;
        __IO  uint32_t  CR3                      :1;
        __IO  uint32_t  CR4                      :1;
        __IO  uint32_t  CR5                      :1;
        __IO  uint32_t  CR6                      :1;
        __IO  uint32_t  CR7                      :1;
        __IO  uint32_t  CR8                      :1;
        __IO  uint32_t  CR9                      :1;
        __IO  uint32_t  CR10                     :1;
        __IO  uint32_t  CR11                     :1;
        __IO  uint32_t  CR12                     :1;
        __IO  uint32_t  CR13                     :1;
        __IO  uint32_t  CR14                     :1;
        __IO  uint32_t  CR15                     :1;
        __IO  uint32_t  CR16                     :1;
        __IO  uint32_t  CR17                     :1;
        __IO  uint32_t  CR18                     :1;
        __IO  uint32_t  CR19                     :1;
        __IO  uint32_t  CR20                     :1;
        __IO  uint32_t  CR21                     :1;
        __IO  uint32_t  CR22                     :1;
        __IO  uint32_t  CR23                     :1;
        __IO  uint32_t  CR24                     :1;
        __IO  uint32_t  CR25                     :1;
        __IO  uint32_t  CR26                     :1;
        __IO  uint32_t  CR27                     :1;
        __IO  uint32_t  CR28                     :1;
        __IO  uint32_t  CR29                     :1;
        __IO  uint32_t  CR30                     :1;
        __IO  uint32_t  CR31                     :1;
} stc_canfd_txbcr_field_t;

typedef struct stc_canfd_txbto_field
{
        __IO  uint32_t  TO0                      :1;
        __IO  uint32_t  TO1                      :1;
        __IO  uint32_t  TO2                      :1;
        __IO  uint32_t  TO3                      :1;
        __IO  uint32_t  TO4                      :1;
        __IO  uint32_t  TO5                      :1;
        __IO  uint32_t  TO6                      :1;
        __IO  uint32_t  TO7                      :1;
        __IO  uint32_t  TO8                      :1;
        __IO  uint32_t  TO9                      :1;
        __IO  uint32_t  TO10                     :1;
        __IO  uint32_t  TO11                     :1;
        __IO  uint32_t  TO12                     :1;
        __IO  uint32_t  TO13                     :1;
        __IO  uint32_t  TO14                     :1;
        __IO  uint32_t  TO15                     :1;
        __IO  uint32_t  TO16                     :1;
        __IO  uint32_t  TO17                     :1;
        __IO  uint32_t  TO18                     :1;
        __IO  uint32_t  TO19                     :1;
        __IO  uint32_t  TO20                     :1;
        __IO  uint32_t  TO21                     :1;
        __IO  uint32_t  TO22                     :1;
        __IO  uint32_t  TO23                     :1;
        __IO  uint32_t  TO24                     :1;
        __IO  uint32_t  TO25                     :1;
        __IO  uint32_t  TO26                     :1;
        __IO  uint32_t  TO27                     :1;
        __IO  uint32_t  TO28                     :1;
        __IO  uint32_t  TO29                     :1;
        __IO  uint32_t  TO30                     :1;
        __IO  uint32_t  TO31                     :1;
} stc_canfd_txbto_field_t;

typedef struct stc_canfd_txbcf_field
{
        __IO  uint32_t  CF0                      :1;
        __IO  uint32_t  CF1                      :1;
        __IO  uint32_t  CF2                      :1;
        __IO  uint32_t  CF3                      :1;
        __IO  uint32_t  CF4                      :1;
        __IO  uint32_t  CF5                      :1;
        __IO  uint32_t  CF6                      :1;
        __IO  uint32_t  CF7                      :1;
        __IO  uint32_t  CF8                      :1;
        __IO  uint32_t  CF9                      :1;
        __IO  uint32_t  CF10                     :1;
        __IO  uint32_t  CF11                     :1;
        __IO  uint32_t  CF12                     :1;
        __IO  uint32_t  CF13                     :1;
        __IO  uint32_t  CF14                     :1;
        __IO  uint32_t  CF15                     :1;
        __IO  uint32_t  CF16                     :1;
        __IO  uint32_t  CF17                     :1;
        __IO  uint32_t  CF18                     :1;
        __IO  uint32_t  CF19                     :1;
        __IO  uint32_t  CF20                     :1;
        __IO  uint32_t  CF21                     :1;
        __IO  uint32_t  CF22                     :1;
        __IO  uint32_t  CF23                     :1;
        __IO  uint32_t  CF24                     :1;
        __IO  uint32_t  CF25                     :1;
        __IO  uint32_t  CF26                     :1;
        __IO  uint32_t  CF27                     :1;
        __IO  uint32_t  CF28                     :1;
        __IO  uint32_t  CF29                     :1;
        __IO  uint32_t  CF30                     :1;
        __IO  uint32_t  CF31                     :1;
} stc_canfd_txbcf_field_t;

