mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2d5xg/common/s6e2d5xg.h
/*******************************************************************************
* GDCPRE_MODULE
*******************************************************************************/
typedef struct stc_gdcpre_gccr_field
{
        __IO   uint8_t  GSSEN                    :1;
        __IO   uint8_t  RESERVED0                :7;
} stc_gdcpre_gccr_field_t;

typedef struct stc_gdcpre_gpcr1_field
{
        __IO   uint8_t  GPLLEN                   :1;
        __IO   uint8_t  GPINC                    :1;
        __IO   uint8_t  RESERVED0                :6;
} stc_gdcpre_gpcr1_field_t;

typedef struct stc_gdcpre_gpcr2_field
{
    union {
        struct {
            __IO   uint8_t  GPOWT                :3;
            __IO   uint8_t  RESERVED0            :5;
        };
        struct {
            __IO   uint8_t  GPOWT0               :1;
            __IO   uint8_t  GPOWT1               :1;
            __IO   uint8_t  GPOWT2               :1;
            __IO   uint8_t  RESERVED1            :5;
        };
    };
} stc_gdcpre_gpcr2_field_t;

typedef struct stc_gdcpre_gpcr3_field
{
    union {
        struct {
            __IO   uint8_t  GPLLK                :5;
            __IO   uint8_t  RESERVED0            :3;
        };
        struct {
            __IO   uint8_t  GPLLK0               :1;
            __IO   uint8_t  GPLLK1               :1;
            __IO   uint8_t  GPLLK2               :1;
            __IO   uint8_t  GPLLK3               :1;
            __IO   uint8_t  GPLLK4               :1;
            __IO   uint8_t  RESERVED1            :3;
        };
    };
} stc_gdcpre_gpcr3_field_t;

typedef struct stc_gdcpre_gpcr4_field
{
    union {
        struct {
            __IO   uint8_t  GPLLN                :7;
            __IO   uint8_t  RESERVED0            :1;
        };
        struct {
            __IO   uint8_t  GPLLN0               :1;
            __IO   uint8_t  GPLLN1               :1;
            __IO   uint8_t  GPLLN2               :1;
            __IO   uint8_t  GPLLN3               :1;
            __IO   uint8_t  GPLLN4               :1;
            __IO   uint8_t  GPLLN5               :1;
            __IO   uint8_t  GPLLN6               :1;
            __IO   uint8_t  RESERVED1            :1;
        };
    };
} stc_gdcpre_gpcr4_field_t;

typedef struct stc_gdcpre_gp_str_field
{
        __IO   uint8_t  GPRDY                    :1;
        __IO   uint8_t  RESERVED0                :7;
} stc_gdcpre_gp_str_field_t;

typedef struct stc_gdcpre_gpint_enr_field
{
        __IO   uint8_t  GPCSE                    :1;
        __IO   uint8_t  RESERVED0                :7;
} stc_gdcpre_gpint_enr_field_t;

typedef struct stc_gdcpre_gpint_clr_field
{
        __IO   uint8_t  GPCSC                    :1;
        __IO   uint8_t  RESERVED0                :7;
} stc_gdcpre_gpint_clr_field_t;

typedef struct stc_gdcpre_gpint_str_field
{
        __IO   uint8_t  GPCSI                    :1;
        __IO   uint8_t  RESERVED0                :7;
} stc_gdcpre_gpint_str_field_t;

typedef struct stc_gdcpre_gcsr_field
{
    union {
        struct {
            __IO  uint16_t  ASEL                 :2;
            __IO  uint16_t  RESERVED0            :2;
            __IO  uint16_t  ACG                  :1;
            __IO  uint16_t  RESERVED1            :3;
            __IO  uint16_t  PSEL                 :1;
            __IO  uint16_t  RESERVED2            :3;
            __IO  uint16_t  PCG                  :1;
            __IO  uint16_t  RESERVED3            :3;
        };
        struct {
            __IO  uint16_t  ASEL0                :1;
            __IO  uint16_t  ASEL1                :1;
            __IO  uint16_t  RESERVED4            :14;
        };
    };
} stc_gdcpre_gcsr_field_t;

typedef struct stc_gdcpre_grcr_field
{
        __IO   uint8_t  RSTEN                    :1;
        __IO   uint8_t  RESERVED0                :7;
} stc_gdcpre_grcr_field_t;

typedef struct stc_gdcpre_gmcr_field
{
        __IO   uint8_t  TEN                      :1;
        __IO   uint8_t  RESERVED0                :7;
} stc_gdcpre_gmcr_field_t;

/*******************************************************************************
* GDCSUB_MODULE
*******************************************************************************/
typedef struct stc_gdcsub_lockunlock_field
{
    union {
        struct {
            __IO  uint32_t  LOCKUNLOCK           :32;
        };
        struct {
            __IO  uint32_t  LOCKUNLOCK0          :1;
            __IO  uint32_t  LOCKUNLOCK1          :1;
            __IO  uint32_t  LOCKUNLOCK2          :1;
            __IO  uint32_t  LOCKUNLOCK3          :1;
            __IO  uint32_t  LOCKUNLOCK4          :1;
            __IO  uint32_t  LOCKUNLOCK5          :1;
            __IO  uint32_t  LOCKUNLOCK6          :1;
            __IO  uint32_t  LOCKUNLOCK7          :1;
            __IO  uint32_t  LOCKUNLOCK8          :1;
            __IO  uint32_t  LOCKUNLOCK9          :1;
            __IO  uint32_t  LOCKUNLOCK10         :1;
            __IO  uint32_t  LOCKUNLOCK11         :1;
            __IO  uint32_t  LOCKUNLOCK12         :1;
            __IO  uint32_t  LOCKUNLOCK13         :1;
            __IO  uint32_t  LOCKUNLOCK14         :1;
            __IO  uint32_t  LOCKUNLOCK15         :1;
            __IO  uint32_t  LOCKUNLOCK16         :1;
            __IO  uint32_t  LOCKUNLOCK17         :1;
            __IO  uint32_t  LOCKUNLOCK18         :1;
            __IO  uint32_t  LOCKUNLOCK19         :1;
            __IO  uint32_t  LOCKUNLOCK20         :1;
            __IO  uint32_t  LOCKUNLOCK21         :1;
            __IO  uint32_t  LOCKUNLOCK22         :1;
            __IO  uint32_t  LOCKUNLOCK23         :1;
            __IO  uint32_t  LOCKUNLOCK24         :1;
            __IO  uint32_t  LOCKUNLOCK25         :1;
            __IO  uint32_t  LOCKUNLOCK26         :1;
            __IO  uint32_t  LOCKUNLOCK27         :1;
            __IO  uint32_t  LOCKUNLOCK28         :1;
            __IO  uint32_t  LOCKUNLOCK29         :1;
            __IO  uint32_t  LOCKUNLOCK30         :1;
            __IO  uint32_t  LOCKUNLOCK31         :1;
        };
    };
} stc_gdcsub_lockunlock_field_t;

typedef struct stc_gdcsub_lockstatus_field
{
        __IO  uint32_t  LOCKSTATUS               :1;
        __IO  uint32_t  RESERVED0                :3;
        __IO  uint32_t  PRIVILEGESTATUS          :1;
        __IO  uint32_t  RESERVED1                :3;
        __IO  uint32_t  FREEZSTATUS              :1;
        __IO  uint32_t  RESERVED2                :23;
} stc_gdcsub_lockstatus_field_t;

typedef struct stc_gdcsub_configclockcontrol_field
{
    union {
        struct {
            __IO  uint32_t  CONFIGCLOCKSELECT    :3;
            __IO  uint32_t  RESERVED0            :29;
        };
        struct {
            __IO  uint32_t  CONFIGCLOCKSELECT0   :1;
            __IO  uint32_t  CONFIGCLOCKSELECT1   :1;
            __IO  uint32_t  CONFIGCLOCKSELECT2   :1;
            __IO  uint32_t  RESERVED1            :29;
        };
    };
} stc_gdcsub_configclockcontrol_field_t;

