mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2d5xg/common/s6e2d5xg.h
typedef struct stc_gdcsub_vraminterruptenable_field
{
        __IO  uint32_t  VRAMINTERRUPTENABLESEC0  :1;
        __IO  uint32_t  VRAMINTERRUPTENABLESEC1  :1;
        __IO  uint32_t  RESERVED0                :30;
} stc_gdcsub_vraminterruptenable_field_t;

typedef struct stc_gdcsub_vraminterruptclear_field
{
        __IO  uint32_t  VRAMINTERRUPTCLEARSEC0   :1;
        __IO  uint32_t  VRAMINTERRUPTCLEARSEC1   :1;
        __IO  uint32_t  RESERVED0                :30;
} stc_gdcsub_vraminterruptclear_field_t;

typedef struct stc_gdcsub_vraminterruptstatus_field
{
        __IO  uint32_t  VRAMINTERRUPTSTATUSSEC0  :1;
        __IO  uint32_t  VRAMINTERRUPTSTATUSSEC1  :1;
        __IO  uint32_t  RESERVED0                :30;
} stc_gdcsub_vraminterruptstatus_field_t;

typedef struct stc_gdcsub_extflashdevselect_field
{
        __IO  uint32_t  EXTFLASHDEVSELECT        :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_gdcsub_extflashdevselect_field_t;

typedef struct stc_gdcsub_vramremapdisable_field
{
        __IO  uint32_t  VRAMREMAPDISABLE         :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_gdcsub_vramremapdisable_field_t;

typedef struct stc_gdcsub_panicswitch_field
{
        __IO  uint32_t  PANICSWITCH              :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_gdcsub_panicswitch_field_t;

typedef struct stc_gdcsub_gdc_clockdivider_field
{
    union {
        struct {
            __IO  uint32_t  RESERVED0            :8;
            __IO  uint32_t  GDCCLOCKSELECT       :16;
            __IO  uint32_t  RESERVED2            :8;
        };
        struct {
            __IO  uint32_t  RESERVED1            :8;
            __IO  uint32_t  GDCCLOCKSELECT0      :1;
            __IO  uint32_t  GDCCLOCKSELECT1      :1;
            __IO  uint32_t  GDCCLOCKSELECT2      :1;
            __IO  uint32_t  GDCCLOCKSELECT3      :1;
            __IO  uint32_t  GDCCLOCKSELECT4      :1;
            __IO  uint32_t  GDCCLOCKSELECT5      :1;
            __IO  uint32_t  GDCCLOCKSELECT6      :1;
            __IO  uint32_t  GDCCLOCKSELECT7      :1;
            __IO  uint32_t  GDCCLOCKSELECT8      :1;
            __IO  uint32_t  GDCCLOCKSELECT9      :1;
            __IO  uint32_t  GDCCLOCKSELECT10     :1;
            __IO  uint32_t  GDCCLOCKSELECT11     :1;
            __IO  uint32_t  GDCCLOCKSELECT12     :1;
            __IO  uint32_t  GDCCLOCKSELECT13     :1;
            __IO  uint32_t  GDCCLOCKSELECT14     :1;
            __IO  uint32_t  GDCCLOCKSELECT15     :1;
            __IO  uint32_t  RESERVED3            :8;
        };
    };
} stc_gdcsub_gdc_clockdivider_field_t;

typedef struct stc_gdcsub_wkuptriggermask_field
{
    union {
        struct {
            __IO  uint32_t  WTRIGMASKGE          :19;
            __IO  uint32_t  RESERVED0            :5;
            __IO  uint32_t  WTRIGMASKQSPI        :1;
            __IO  uint32_t  WTRIGMASKSDRAM       :1;
            __IO  uint32_t  WTRIGMASKRPC         :1;
            __IO  uint32_t  RESERVED1            :5;
        };
        struct {
            __IO  uint32_t  WTRIGMASKGE0         :1;
            __IO  uint32_t  WTRIGMASKGE1         :1;
            __IO  uint32_t  WTRIGMASKGE2         :1;
            __IO  uint32_t  WTRIGMASKGE3         :1;
            __IO  uint32_t  WTRIGMASKGE4         :1;
            __IO  uint32_t  WTRIGMASKGE5         :1;
            __IO  uint32_t  WTRIGMASKGE6         :1;
            __IO  uint32_t  WTRIGMASKGE7         :1;
            __IO  uint32_t  WTRIGMASKGE8         :1;
            __IO  uint32_t  WTRIGMASKGE9         :1;
            __IO  uint32_t  WTRIGMASKGE10        :1;
            __IO  uint32_t  WTRIGMASKGE11        :1;
            __IO  uint32_t  WTRIGMASKGE12        :1;
            __IO  uint32_t  WTRIGMASKGE13        :1;
            __IO  uint32_t  WTRIGMASKGE14        :1;
            __IO  uint32_t  WTRIGMASKGE15        :1;
            __IO  uint32_t  WTRIGMASKGE16        :1;
            __IO  uint32_t  WTRIGMASKGE17        :1;
            __IO  uint32_t  WTRIGMASKGE18        :1;
            __IO  uint32_t  RESERVED2            :13;
        };
    };
} stc_gdcsub_wkuptriggermask_field_t;

typedef struct stc_gdcsub_clockdomainstatus_field
{
        __IO  uint32_t  DSPCLOCKDOMAINREADY      :1;
        __IO  uint32_t  SDRAMCLOCKDOMAINREADY    :1;
        __IO  uint32_t  RPCCLOCKDOMAINREADY      :1;
        __IO  uint32_t  HSSPICLOCKDOMAINREADY    :1;
        __IO  uint32_t  RESERVED0                :28;
} stc_gdcsub_clockdomainstatus_field_t;

typedef struct stc_gdcsub_dsp_lockunlock_field
{
    union {
        struct {
            __IO  uint32_t  DSP_LOCKUNLOCK       :32;
        };
        struct {
            __IO  uint32_t  DSP_LOCKUNLOCK0      :1;
            __IO  uint32_t  DSP_LOCKUNLOCK1      :1;
            __IO  uint32_t  DSP_LOCKUNLOCK2      :1;
            __IO  uint32_t  DSP_LOCKUNLOCK3      :1;
            __IO  uint32_t  DSP_LOCKUNLOCK4      :1;
            __IO  uint32_t  DSP_LOCKUNLOCK5      :1;
            __IO  uint32_t  DSP_LOCKUNLOCK6      :1;
            __IO  uint32_t  DSP_LOCKUNLOCK7      :1;
            __IO  uint32_t  DSP_LOCKUNLOCK8      :1;
            __IO  uint32_t  DSP_LOCKUNLOCK9      :1;
            __IO  uint32_t  DSP_LOCKUNLOCK10     :1;
            __IO  uint32_t  DSP_LOCKUNLOCK11     :1;
            __IO  uint32_t  DSP_LOCKUNLOCK12     :1;
            __IO  uint32_t  DSP_LOCKUNLOCK13     :1;
            __IO  uint32_t  DSP_LOCKUNLOCK14     :1;
            __IO  uint32_t  DSP_LOCKUNLOCK15     :1;
            __IO  uint32_t  DSP_LOCKUNLOCK16     :1;
            __IO  uint32_t  DSP_LOCKUNLOCK17     :1;
            __IO  uint32_t  DSP_LOCKUNLOCK18     :1;
            __IO  uint32_t  DSP_LOCKUNLOCK19     :1;
            __IO  uint32_t  DSP_LOCKUNLOCK20     :1;
            __IO  uint32_t  DSP_LOCKUNLOCK21     :1;
            __IO  uint32_t  DSP_LOCKUNLOCK22     :1;
            __IO  uint32_t  DSP_LOCKUNLOCK23     :1;
            __IO  uint32_t  DSP_LOCKUNLOCK24     :1;
            __IO  uint32_t  DSP_LOCKUNLOCK25     :1;
            __IO  uint32_t  DSP_LOCKUNLOCK26     :1;
            __IO  uint32_t  DSP_LOCKUNLOCK27     :1;
            __IO  uint32_t  DSP_LOCKUNLOCK28     :1;
            __IO  uint32_t  DSP_LOCKUNLOCK29     :1;
            __IO  uint32_t  DSP_LOCKUNLOCK30     :1;
            __IO  uint32_t  DSP_LOCKUNLOCK31     :1;
        };
    };
} stc_gdcsub_dsp_lockunlock_field_t;

