mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2d5xg/common/s6e2d5xg.h
typedef struct stc_gpio_epfr30_field
{
    union {
        struct {
            __IO  uint32_t  PNL_PWEE             :2;
            __IO  uint32_t  PNL_DCLKE            :2;
            __IO  uint32_t  PNL_DENE             :2;
            __IO  uint32_t  PNL_LEE              :2;
            __IO  uint32_t  PNL_FV_SYNCE         :2;
            __IO  uint32_t  PNL_LH_SYNCE         :2;
            __IO  uint32_t  RESERVED0            :4;
            __IO  uint32_t  PNL_TSIG0E           :2;
            __IO  uint32_t  PNL_TSIG1E           :2;
            __IO  uint32_t  PNL_TSIG2E           :2;
            __IO  uint32_t  PNL_TSIG3E           :2;
            __IO  uint32_t  PNL_TSIG4E           :2;
            __IO  uint32_t  RESERVED2            :6;
        };
        struct {
            __IO  uint32_t  PNL_PWEE0            :1;
            __IO  uint32_t  PNL_PWEE1            :1;
            __IO  uint32_t  PNL_DCLKE0           :1;
            __IO  uint32_t  PNL_DCLKE1           :1;
            __IO  uint32_t  PNL_DENE0            :1;
            __IO  uint32_t  PNL_DENE1            :1;
            __IO  uint32_t  PNL_LEE0             :1;
            __IO  uint32_t  PNL_LEE1             :1;
            __IO  uint32_t  PNL_FV_SYNCE0        :1;
            __IO  uint32_t  PNL_FV_SYNCE1        :1;
            __IO  uint32_t  PNL_LH_SYNCE0        :1;
            __IO  uint32_t  PNL_LH_SYNCE1        :1;
            __IO  uint32_t  RESERVED1            :4;
            __IO  uint32_t  PNL_TSIG0E0          :1;
            __IO  uint32_t  PNL_TSIG0E1          :1;
            __IO  uint32_t  PNL_TSIG1E0          :1;
            __IO  uint32_t  PNL_TSIG1E1          :1;
            __IO  uint32_t  PNL_TSIG2E0          :1;
            __IO  uint32_t  PNL_TSIG2E1          :1;
            __IO  uint32_t  PNL_TSIG3E0          :1;
            __IO  uint32_t  PNL_TSIG3E1          :1;
            __IO  uint32_t  PNL_TSIG4E0          :1;
            __IO  uint32_t  PNL_TSIG4E1          :1;
            __IO  uint32_t  RESERVED3            :6;
        };
    };
} stc_gpio_epfr30_field_t;

typedef struct stc_gpio_pzr0_field
{
        __IO  uint32_t  P0                       :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  P2                       :1;
        __IO  uint32_t  P3                       :1;
        __IO  uint32_t  P4                       :1;
        __IO  uint32_t  P5                       :1;
        __IO  uint32_t  P6                       :1;
        __IO  uint32_t  P7                       :1;
        __IO  uint32_t  P8                       :1;
        __IO  uint32_t  P9                       :1;
        __IO  uint32_t  PA                       :1;
        __IO  uint32_t  PB                       :1;
        __IO  uint32_t  PC                       :1;
        __IO  uint32_t  PD                       :1;
        __IO  uint32_t  PE                       :1;
        __IO  uint32_t  RESERVED0                :17;
} stc_gpio_pzr0_field_t;

typedef struct stc_gpio_pzr1_field
{
        __IO  uint32_t  P0                       :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  P2                       :1;
        __IO  uint32_t  P3                       :1;
        __IO  uint32_t  P4                       :1;
        __IO  uint32_t  P5                       :1;
        __IO  uint32_t  P6                       :1;
        __IO  uint32_t  P7                       :1;
        __IO  uint32_t  P8                       :1;
        __IO  uint32_t  P9                       :1;
        __IO  uint32_t  PA                       :1;
        __IO  uint32_t  PB                       :1;
        __IO  uint32_t  PC                       :1;
        __IO  uint32_t  PD                       :1;
        __IO  uint32_t  PE                       :1;
        __IO  uint32_t  PF                       :1;
        __IO  uint32_t  RESERVED0                :16;
} stc_gpio_pzr1_field_t;

typedef struct stc_gpio_pzr2_field
{
        __IO  uint32_t  P0                       :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  P2                       :1;
        __IO  uint32_t  P3                       :1;
        __IO  uint32_t  P4                       :1;
        __IO  uint32_t  P5                       :1;
        __IO  uint32_t  P6                       :1;
        __IO  uint32_t  P7                       :1;
        __IO  uint32_t  RESERVED0                :24;
} stc_gpio_pzr2_field_t;

typedef struct stc_gpio_pzr3_field
{
        __IO  uint32_t  RESERVED0                :3;
        __IO  uint32_t  P3                       :1;
        __IO  uint32_t  P4                       :1;
        __IO  uint32_t  P5                       :1;
        __IO  uint32_t  P6                       :1;
        __IO  uint32_t  P7                       :1;
        __IO  uint32_t  P8                       :1;
        __IO  uint32_t  P9                       :1;
        __IO  uint32_t  PA                       :1;
        __IO  uint32_t  PB                       :1;
        __IO  uint32_t  PC                       :1;
        __IO  uint32_t  PD                       :1;
        __IO  uint32_t  PE                       :1;
        __IO  uint32_t  PF                       :1;
        __IO  uint32_t  RESERVED1                :16;
} stc_gpio_pzr3_field_t;

typedef struct stc_gpio_pzr4_field
{
        __IO  uint32_t  RESERVED0                :6;
        __IO  uint32_t  P6                       :1;
        __IO  uint32_t  P7                       :1;
        __IO  uint32_t  P8                       :1;
        __IO  uint32_t  P9                       :1;
        __IO  uint32_t  RESERVED1                :22;
} stc_gpio_pzr4_field_t;

typedef struct stc_gpio_pzr5_field
{
        __IO  uint32_t  P0                       :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  P2                       :1;
        __IO  uint32_t  P3                       :1;
        __IO  uint32_t  P4                       :1;
        __IO  uint32_t  P5                       :1;
        __IO  uint32_t  P6                       :1;
        __IO  uint32_t  RESERVED0                :25;
} stc_gpio_pzr5_field_t;

typedef struct stc_gpio_pzr6_field
{
        __IO  uint32_t  P0                       :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  P2                       :1;
        __IO  uint32_t  P3                       :1;
        __IO  uint32_t  P4                       :1;
        __IO  uint32_t  P5                       :1;
        __IO  uint32_t  P6                       :1;
        __IO  uint32_t  P7                       :1;
        __IO  uint32_t  P8                       :1;
        __IO  uint32_t  RESERVED0                :23;
} stc_gpio_pzr6_field_t;

typedef struct stc_gpio_pzr7_field
{
        __IO  uint32_t  P0                       :1;
        __IO  uint32_t  P1                       :1;
        __IO  uint32_t  P2                       :1;
        __IO  uint32_t  P3                       :1;
        __IO  uint32_t  P4                       :1;
        __IO  uint32_t  P5                       :1;
        __IO  uint32_t  P6                       :1;
        __IO  uint32_t  P7                       :1;
        __IO  uint32_t  P8                       :1;
        __IO  uint32_t  P9                       :1;
        __IO  uint32_t  PA                       :1;
        __IO  uint32_t  PB                       :1;
        __IO  uint32_t  PC                       :1;
        __IO  uint32_t  RESERVED0                :19;
} stc_gpio_pzr7_field_t;

