mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2d5xg/common/s6e2d5xg.h
/*******************************************************************************
* SBSSR_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
        __IO  uint8_t RESERVED0[252];
    union {
        __IO uint16_t BTSSSR;
        stc_sbssr_btsssr_field_t BTSSSR_f;
        struct {
            __IO  uint8_t BTSSSRL;
            __IO  uint8_t BTSSSRH;
        };
    };
} FM_SBSSR_TypeDef, FM4_SBSSR_TypeDef;

/*******************************************************************************
* SDRAMC_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
        __IO  uint8_t RESERVED0[256];
    union {
        __IO uint32_t SDMODE;
        stc_sdramc_sdmode_field_t SDMODE_f;
        struct {
          union {
            __IO uint16_t SDMODEL;
            struct {
              __IO uint8_t SDMODELL;
              __IO uint8_t SDMODELH;
            };
          };
          union {
            __IO uint16_t SDMODEH;
            struct {
              __IO uint8_t SDMODEHL;
              __IO uint8_t SDMODEHH;
            };
          };
        };
    };
    union {
        __IO uint32_t REFTIM;
        stc_sdramc_reftim_field_t REFTIM_f;
        struct {
          union {
            __IO uint16_t REFTIML;
            struct {
              __IO uint8_t REFTIMLL;
              __IO uint8_t REFTIMLH;
            };
          };
          union {
            __IO uint16_t REFTIMH;
            struct {
              __IO uint8_t REFTIMHL;
              __IO uint8_t REFTIMHH;
            };
          };
        };
    };
    union {
        __IO uint32_t PWRDWN;
        stc_sdramc_pwrdwn_field_t PWRDWN_f;
        struct {
          union {
            __IO uint16_t PWRDWNL;
            struct {
              __IO uint8_t PWRDWNLL;
              __IO uint8_t PWRDWNLH;
            };
          };
          union {
            __IO uint16_t PWRDWNH;
            struct {
              __IO uint8_t PWRDWNHL;
              __IO uint8_t PWRDWNHH;
            };
          };
        };
    };
    union {
        __IO uint32_t SDTIM;
        stc_sdramc_sdtim_field_t SDTIM_f;
        struct {
          union {
            __IO uint16_t SDTIML;
            struct {
              __IO uint8_t SDTIMLL;
              __IO uint8_t SDTIMLH;
            };
          };
          union {
            __IO uint16_t SDTIMH;
            struct {
              __IO uint8_t SDTIMHL;
              __IO uint8_t SDTIMHH;
            };
          };
        };
    };
    union {
        __IO uint32_t SDCMD;
        stc_sdramc_sdcmd_field_t SDCMD_f;
        struct {
          union {
            __IO uint16_t SDCMDL;
            struct {
              __IO uint8_t SDCMDLL;
              __IO uint8_t SDCMDLH;
            };
          };
          union {
            __IO uint16_t SDCMDH;
            struct {
              __IO uint8_t SDCMDHL;
              __IO uint8_t SDCMDHH;
            };
          };
        };
    };
} FM_SDRAMC_TypeDef, FM4_SDRAMC_TypeDef;

/*******************************************************************************
* SWWDT_MODULE
*   register structur
*******************************************************************************/
typedef struct
{
    union {
        __IO uint32_t WDOGLOAD;
        struct {
          union {
            __IO uint16_t WDOGLOADL;
            struct {
              __IO uint8_t WDOGLOADLL;
              __IO uint8_t WDOGLOADLH;
            };
          };
          union {
            __IO uint16_t WDOGLOADH;
            struct {
              __IO uint8_t WDOGLOADHL;
              __IO uint8_t WDOGLOADHH;
            };
          };
        };
    };
    union {
        __IO uint32_t WDOGVALUE;
        struct {
          union {
            __IO uint16_t WDOGVALUEL;
            struct {
              __IO uint8_t WDOGVALUELL;
              __IO uint8_t WDOGVALUELH;
            };
          };
          union {
            __IO uint16_t WDOGVALUEH;
            struct {
              __IO uint8_t WDOGVALUEHL;
              __IO uint8_t WDOGVALUEHH;
            };
          };
        };
    };
    union {
        __IO uint32_t WDOGCONTROL;
        stc_swwdt_wdogcontrol_field_t WDOGCONTROL_f;
        struct {
          union {
            __IO uint16_t WDOGCONTROLL;
            struct {
              __IO uint8_t WDOGCONTROLLL;
              __IO uint8_t WDOGCONTROLLH;
            };
          };
          union {
            __IO uint16_t WDOGCONTROLH;
            struct {
              __IO uint8_t WDOGCONTROLHL;
              __IO uint8_t WDOGCONTROLHH;
            };
          };
        };
    };
    union {
        __IO uint32_t WDOGINTCLR;
        struct {
          union {
            __IO uint16_t WDOGINTCLRL;
            struct {
              __IO uint8_t WDOGINTCLRLL;
              __IO uint8_t WDOGINTCLRLH;
            };
          };
          union {
            __IO uint16_t WDOGINTCLRH;
            struct {
              __IO uint8_t WDOGINTCLRHL;
              __IO uint8_t WDOGINTCLRHH;
            };
          };
        };
    };
    union {
        __IO uint32_t WDOGRIS;
        stc_swwdt_wdogris_field_t WDOGRIS_f;
        struct {
          union {
            __IO uint16_t WDOGRISL;
            struct {
              __IO uint8_t WDOGRISLL;
              __IO uint8_t WDOGRISLH;
            };
          };
          union {
            __IO uint16_t WDOGRISH;
            struct {
              __IO uint8_t WDOGRISHL;
              __IO uint8_t WDOGRISHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED0[4];
    union {
        __IO uint32_t WDOGSPMC;
        stc_swwdt_wdogspmc_field_t WDOGSPMC_f;
        struct {
          union {
            __IO uint16_t WDOGSPMCL;
            struct {
              __IO uint8_t WDOGSPMCLL;
              __IO uint8_t WDOGSPMCLH;
            };
          };
          union {
            __IO uint16_t WDOGSPMCH;
            struct {
              __IO uint8_t WDOGSPMCHL;
              __IO uint8_t WDOGSPMCHH;
            };
          };
        };
    };
        __IO  uint8_t RESERVED1[3044];
    union {
        __IO uint32_t WDOGLOCK;
        struct {
          union {
            __IO uint16_t WDOGLOCKL;
            struct {
              __IO uint8_t WDOGLOCKLL;
              __IO uint8_t WDOGLOCKLH;
            };
          };
          union {
            __IO uint16_t WDOGLOCKH;
            struct {
              __IO uint8_t WDOGLOCKHL;
              __IO uint8_t WDOGLOCKHH;
            };
          };
        };
    };
} FM_SWWDT_TypeDef, FM4_SWWDT_TypeDef;

